Import the relevant libraries

In [123]:
import pandas as pd
import numpy as np
import sqlite3
import os

In [124]:
budget = pd.read_csv('./datasets/tn.movie_budgets.csv')
# Set the first column as the index
budget.set_index(budget.columns[0], inplace=True)
budget.head(10)

,release_date,movie,production_budget,domestic_gross,worldwide_gross
id,,,,,
1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
6,"Dec 18, 2015",Star Wars Ep. VII: The Force Awakens,"$306,000,000","$936,662,225","$2,053,311,220"
7,"Apr 27, 2018",Avengers: Infinity War,"$300,000,000","$678,815,482","$2,048,134,200"
8,"May 24, 2007",Pirates of the Caribbean: At Worldâs End,"$300,000,000","$309,420,425","$963,420,425"
9,"Nov 17, 2017",Justice League,"$300,000,000","$229,024,295","$655,945,209"
10,"Nov 6, 2015",Spectre,"$300,000,000","$200,074,175","$879,620,923"

The data in the csv file shows production costs and the domestic/worldwide gross. This means we can get the net profit/loss of the movie. We will be using the worldwide gross since Microsoft is an international company and it's local consumers are just as important as the worldwide ones.

We begin by getting rid of the $ sign to enable numeric applications

In [126]:
budget['production_budget'] = pd.to_numeric(budget['production_budget'].astype(str).str.replace('[\$,]', '', regex=True), errors='coerce')
budget['domestic_gross'] = pd.to_numeric(budget['domestic_gross'].astype(str).str.replace('[\$,]', '', regex=True), errors='coerce')
budget['worldwide_gross'] = pd.to_numeric(budget['worldwide_gross'].astype(str).str.replace('[\$,]', '', regex=True), errors='coerce')

# Create the revenue column
budget['revenue'] = budget['worldwide_gross'] - budget['production_budget']
budget.head(10)

,release_date,movie,production_budget,domestic_gross,worldwide_gross,revenue
id,,,,,,
1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279,2351345279
2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,635063875
3,"Jun 7, 2019",Dark Phoenix,350000000,42762350,149762350,-200237650
4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868,1403013963,1072413963
5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,999721747
6,"Dec 18, 2015",Star Wars Ep. VII: The Force Awakens,306000000,936662225,2053311220,1747311220
7,"Apr 27, 2018",Avengers: Infinity War,300000000,678815482,2048134200,1748134200
8,"May 24, 2007",Pirates of the Caribbean: At Worldâs End,300000000,309420425,963420425,663420425
9,"Nov 17, 2017",Justice League,300000000,229024295,655945209,355945209
10,"Nov 6, 2015",Spectre,300000000,200074175,879620923,579620923

In [122]:
top_10_revenue = budget.nlargest(10, 'revenue')

# Display the top 10 revenue values
top_10_revenue.head(10)

,release_date,movie,production_budget,domestic_gross,worldwide_gross,revenue
id,,,,,,
1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279,2351345279
43,"Dec 19, 1997",Titanic,200000000,659363944,2208208395,2008208395
7,"Apr 27, 2018",Avengers: Infinity War,300000000,678815482,2048134200,1748134200
6,"Dec 18, 2015",Star Wars Ep. VII: The Force Awakens,306000000,936662225,2053311220,1747311220
34,"Jun 12, 2015",Jurassic World,215000000,652270625,1648854864,1433854864
67,"Apr 3, 2015",Furious 7,190000000,353007020,1518722794,1328722794
27,"May 4, 2012",The Avengers,225000000,623279547,1517935897,1292935897
61,"Jul 15, 2011",Harry Potter and the Deathly Hallows: Part II,125000000,381193157,1341693157,1216693157
42,"Feb 16, 2018",Black Panther,200000000,700059566,1348258224,1148258224
13,"Jun 22, 2018",Jurassic World: Fallen Kingdom,170000000,417719760,1305772799,1135772799

The list above shows the top 10 most profitable films.

In [139]:
gross = pd.read_csv('./datasets/bom.movie_gross.csv')
gross.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

Finding the top 10 domestic grossing films

In [144]:
# Find the top 10 domestic grossing films
top_10_domestic = gross.nlargest(30, 'domestic_gross')
print("Top 10 Domestic Grossing Films:")
print(top_10_domestic[['title', 'domestic_gross']])

Top 10 Domestic Grossing Films:
                                            title  domestic_gross
1872                 Star Wars: The Force Awakens     936700000.0
3080                                Black Panther     700100000.0
3079                       Avengers: Infinity War     678800000.0
1873                               Jurassic World     652300000.0
727                         Marvel's The Avengers     623400000.0
2758                     Star Wars: The Last Jedi     620200000.0
3082                                Incredibles 2     608600000.0
2323                 Rogue One: A Star Wars Story     532200000.0
2759                  Beauty and the Beast (2017)     504000000.0
2324                                 Finding Dory     486300000.0
1875                      Avengers: Age of Ultron     459000000.0
729                         The Dark Knight Rises     448100000.0
1131              The Hunger Games: Catching Fire     424700000.0
3081               Jurassic World: Fallen Kingdom     417700000.0
0                                     Toy Story 3     415000000.0
2767                                 Wonder Woman     412600000.0
1128                                   Iron Man 3     409000000.0
2322                   Captain America: Civil War     408100000.0
735                              The Hunger Games     408000000.0
2762               Jumanji: Welcome to the Jungle     404500000.0
1127                                       Frozen     400700000.0
2765               Guardians of the Galaxy Vol. 2     389800000.0
328   Harry Potter and the Deathly Hallows Part 2     381000000.0
2327                      The Secret Life of Pets     368400000.0
1129                              Despicable Me 2     368100000.0
2326                       The Jungle Book (2016)     364000000.0
2330                                     Deadpool     363100000.0
1878                                   Inside Out     356500000.0
1874                                    Furious 7     353000000.0
329                Transformers: Dark of the Moon     352400000.0

In [158]:
# Convert 'foreign_gross' to numeric
gross['foreign_gross'] = pd.to_numeric(gross['foreign_gross'], errors='coerce')
top_10_foreign = gross.nlargest(30, 'foreign_gross')
# Display the top 10 foreign grossing films
print("\nTop 10 Foreign Grossing Films:")
print(top_10_foreign[['title', 'foreign_gross']])

Top 10 Foreign Grossing Films:
                                            title  foreign_gross
328   Harry Potter and the Deathly Hallows Part 2    960500000.0
1875                      Avengers: Age of Ultron    946400000.0
727                         Marvel's The Avengers    895500000.0
3081               Jurassic World: Fallen Kingdom    891800000.0
1127                                       Frozen    875700000.0
2764                               Wolf Warrior 2    867600000.0
1477              Transformers: Age of Extinction    858600000.0
1876                                      Minions    823400000.0
3083                                      Aquaman    812700000.0
1128                                   Iron Man 3    805800000.0
330   Pirates of the Caribbean: On Stranger Tides    804600000.0
728                                       Skyfall    804200000.0
329                Transformers: Dark of the Moon    771400000.0
2761                              Despicable Me 3    770200000.0
2759                  Beauty and the Beast (2017)    759500000.0
2322                   Captain America: Civil War    745200000.0
730             The Hobbit: An Unexpected Journey    718100000.0
731                    Ice Age: Continental Drift    715900000.0
2758                     Star Wars: The Last Jedi    712400000.0
1478    The Hobbit: The Battle of the Five Armies    700900000.0
1130          The Hobbit: The Desolation of Smaug    700000000.0
1                      Alice in Wonderland (2010)    691300000.0
3084                            Bohemian Rhapsody    687200000.0
2325                                     Zootopia    682500000.0
1877                                      Spectre    680600000.0
2     Harry Potter and the Deathly Hallows Part 1    664300000.0
0                                     Toy Story 3    652000000.0
3080                                Black Panther    646900000.0
3085                                 Venom (2018)    641500000.0
729                         The Dark Knight Rises    636800000.0

In [156]:
# Merge the two DataFrames on the 'title' column
merged_top_10 = pd.merge(top_10_domestic, top_10_foreign, on='title', how='inner')

# Display the titles and corresponding gross values that appear in both lists
common_titles = merged_top_10.loc[:, ['title', 'domestic_gross_x', 'foreign_gross_x']]
common_titles.columns = ['title', 'domestic_gross', 'foreign_gross']

print("Titles that appear in both lists:")
print(common_titles)

Titles that appear in both lists:
                                          title  domestic_gross  foreign_gross
0                                 Black Panther     700100000.0    646900000.0
1                         Marvel's The Avengers     623400000.0    895500000.0
2                      Star Wars: The Last Jedi     620200000.0    712400000.0
3                   Beauty and the Beast (2017)     504000000.0    759500000.0
4                       Avengers: Age of Ultron     459000000.0    946400000.0
5                         The Dark Knight Rises     448100000.0    636800000.0
6                Jurassic World: Fallen Kingdom     417700000.0    891800000.0
7                                   Toy Story 3     415000000.0    652000000.0
8                                    Iron Man 3     409000000.0    805800000.0
9                    Captain America: Civil War     408100000.0    745200000.0
10                                       Frozen     400700000.0    875700000.0
11  Harry Potter and the Deathly Hallows Part 2     381000000.0    960500000.0
12               Transformers: Dark of the Moon     352400000.0    771400000.0

In [ ]:
import csv
# Specify the path to your TSV file
reviews_file_path = './datasets/rt.reviews.tsv'

# Open the TSV file and create a CSV DictReader object
with open(reviews_file_path, 'r', newline='', encoding='utf-8') as tsv_file:
    # Specify the delimiter as a tab character ('\t') for TSV files
    reviews = csv.DictReader(tsv_file, delimiter='\t')

    #isolate the column names to see what each one represents
    column_names = reviews.fieldnames
   # print(column_names)
    
    # Iterate through the rows in the TSV file
    for row in reviews:
        rating = row['rating']
       # print(rating)
        # Each row is a dictionary with column names as keys
     #   print(row)

In [53]:
# Connect to SQLite database 
conn = sqlite3.connect('./datasets/im.db')

# Create a cursor object to execute SQL queries
cursor = conn.cursor()
# Query to get table names from sqlite_master table
cursor.execute("""SELECT name 
                      FROM sqlite_master 
                      WHERE type='table';""")

# Fetch all the table names
tables = cursor.fetchall()

# Print the table names
for table in tables:
    print(table)

('movie_basics',)
('directors',)
('known_for',)
('movie_akas',)
('movie_ratings',)
('persons',)
('principals',)
('writers',)

In [56]:
first_query = '''
   SELECT *
   FROM movie_basics;
'''
pd.read_sql(first_query, conn).head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [57]:
second_query = '''
   SELECT *
   FROM movie_ratings;
'''
pd.read_sql(second_query, conn).head()

     movie_id  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [60]:
fourth_query = '''
   SELECT movie_id, averagerating
   FROM movie_ratings
   ORDER BY averagerating DESC
   LIMIT 10;
'''
pd.read_sql(fourth_query, conn)

     movie_id  averagerating
0   tt5390098           10.0
1   tt6295832           10.0
2   tt1770682           10.0
3   tt2632430           10.0
4   tt8730716           10.0
5   tt4960818           10.0
6   tt6991826           10.0
7  tt10176328           10.0
8   tt4944240           10.0
9   tt5089804           10.0

In [79]:
fifth_query = '''
   SELECT DISTINCT original_title, genres, start_year, primary_name, primary_profession
   FROM movie_basics
   JOIN movie_ratings ON movie_basics.movie_id = movie_ratings.movie_id
   JOIN directors ON movie_ratings.movie_id = directors.movie_id
   JOIN persons ON directors.person_id = persons.person_id 
   WHERE movie_ratings.averagerating = 10.0;
'''
pd.read_sql(fifth_query, conn)

,original_title,genres,start_year,primary_name,primary_profession
0,Atlas Mountain: Barbary Macaques - Childcaring...,Documentary,2015,Masahiro Hayakawa,"director,producer"
1,Atlas Mountain: Barbary Macaques - Childcaring...,Documentary,2015,Michael J. Sanderson,"cinematographer,camera_department,producer"
2,Requiem voor een Boom,Documentary,2016,Michiel Brongers,"director,writer"
3,Freeing Bernie Baran,"Crime,Documentary",2010,Daniel Alexander,director
4,Hercule contre Hermès,Documentary,2012,Mohamed Ulad-Mohand,"producer,director,writer"
5,Pick It Up! - Ska in the '90s,Documentary,2019,Taylor Morden,"director,cinematographer,editor"
6,Revolution Food,Documentary,2015,Loreto Di Cesare,"cinematographer,director,producer"
7,A Dedicated Life: Phoebe Brand Beyond the Group,Documentary,2015,Cristina Duarte,"actress,director,writer"
8,Exteriores: Mulheres Brasileiras na Diplomacia,Documentary,2018,Ivana Diniz,"director,writer"
9,Dog Days in the Heartland,Drama,2017,Chad Carpenter,"director,producer,miscellaneous"
10,Fly High: Story of the Disc Dog,Documentary,2019,Lindsay Thompson,"cinematographer,director,actress"
11,Calamity Kevin,"Adventure,Comedy",2019,Emre Oran,"art_director,director,writer"
12,All Around Us,Documentary,2019,Tristan David Luciotti,"actor,writer,producer"
13,I Was Born Yesterday!,Documentary,2015,Soudabeh Moradian,"director,editor,producer"
14,Ellis Island: The Making of a Master Race in A...,"Documentary,History",2018,Robert Tutak,"director,writer,producer"
15,Renegade,Documentary,2019,Stephen Peek,"producer,camera_department,cinematographer"

This clearly shows that among the top 15 movies (each with a rating of 10.0), 12 of the 15 are documentary or part documentary genres. This means that documentary films are the films with the highest ratings making them a no-brainer among films that microsoft should produce. Comedy films come at a distant second.

Even though not as relevant, 13 of the 15 films were also made in the last 10 years. This indicates a preference to newer movies.

Another important factor to note down is the list of directors of the 15 highly rated films. This will give the Microsoft team a top-layer pool of directors to choose from when deciding the film they'd like to produce.

In [76]:
se_query = '''
   SELECT *
   FROM directors;
'''
pd.read_sql(se_query, conn)

         movie_id   person_id
0       tt0285252   nm0899854
1       tt0462036   nm1940585
2       tt0835418   nm0151540
3       tt0835418   nm0151540
4       tt0878654   nm0089502
...           ...         ...
291169  tt8999974  nm10122357
291170  tt9001390   nm6711477
291171  tt9001494  nm10123242
291172  tt9001494  nm10123248
291173  tt9004986   nm4993825

[291174 rows x 2 columns]